In [1]:
import pandas as pd
import numpy as np

In [4]:
s1 = pd.Series([4,7,-5,3]) # 创建一个Series，索引为默认值
print(s1)

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
s1.values # series的值

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
s1.index  # series的索引，从零开始，四结束，不包括4，间隔为1

RangeIndex(start=0, stop=4, step=1)

In [8]:
s2 = pd.Series([4.0,6.5,-0.5,4.3],index = ['d','b','a','c'])
print(s2)

d    4.0
b    6.5
a   -0.5
c    4.3
dtype: float64

In [9]:
s2['b'] # 根据索引提取series的值

6.5

In [10]:
s2[['a','b','c']]

a   -0.5
b    6.5
c    4.3
dtype: float64

In [11]:
'b' in s2

True

In [12]:
'e' in s2

False

In [13]:
# Series 可以看成是一个定长的有序字典
dic1 = {'apple':5,'pen':3,'applepen':10}
s3 = pd.Series(dic1)
print(s3)

apple        5
pen          3
applepen    10
dtype: int64

In [14]:
# DataFrame
data = {'year':[2014,2015,2016,2017],
        'income':[1000,20000,30000,50000],
       'pay':[500,10000,30000,50000]}
df1 = pd.DataFrame(data)
df1

   year  income    pay
0  2014    1000    500
1  2015   20000  10000
2  2016   30000  30000
3  2017   50000  50000

In [17]:
df2 = pd.DataFrame(np.arange(12).reshape((3,4)))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [20]:
df3 = pd.DataFrame(np.arange(12).reshape((3,4)),index=['a','c','b'],columns=[2,33,44,5])
df3

   2   33  44  5
a   0   1   2   3
c   4   5   6   7
b   8   9  10  11

In [21]:
df1.columns # DataFrame 的列

Index(['year', 'income', 'pay'], dtype='object')

In [23]:
df1.index  # DataFrame 的索引

RangeIndex(start=0, stop=4, step=1)

In [24]:
df1.values

array([[ 2014,  1000,   500],
       [ 2015, 20000, 10000],
       [ 2016, 30000, 30000],
       [ 2017, 50000, 50000]], dtype=int64)

In [26]:
df1.describe()

              year        income           pay
count     4.000000      4.000000      4.000000
mean   2015.500000  25250.000000  22625.000000
std       1.290994  20418.537329  22005.207717
min    2014.000000   1000.000000    500.000000
25%    2014.750000  15250.000000   7625.000000
50%    2015.500000  25000.000000  20000.000000
75%    2016.250000  35000.000000  35000.000000
max    2017.000000  50000.000000  50000.000000

In [27]:
df1.T # 转置

           0      1      2      3
year    2014   2015   2016   2017
income  1000  20000  30000  50000
pay      500  10000  30000  50000

In [28]:
df3

   2   33  44  5
a   0   1   2   3
c   4   5   6   7
b   8   9  10  11

In [29]:
df3.sort_index(axis=1) # 列排序

   2   5   33  44
a   0   3   1   2
c   4   7   5   6
b   8  11   9  10

In [30]:
df3.sort_index(axis=0) # 行排序

   2   33  44  5
a   0   1   2   3
b   8   9  10  11
c   4   5   6   7

In [31]:
df3.sort_values(by=44) # 对列为 44 的值进行排序

   2   33  44  5
a   0   1   2   3
c   4   5   6   7
b   8   9  10  11